/*----------------------------------------------------------------------------------------------------------------------
Напишите программу, которая будет преобразовывать десятичное число в двоичное.
----------------------------------------------------------------------------------------------------------------------*/
string ToBin(int Dec)
{
    string res = "";
    while(Dec>0)
    {
        res = Convert.ToString(Dec%2) + res;
        Dec/= 2;
    }
    return res;
}
Console.Write("Введите число в десятичной системы для конвертации в двоичную: ");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine($"{x} => {ToBin(x)}");